Тестовая_база_ERP_14/src/Enums/ХарактерыДоговоровФинансовыхИнструментов/ХарактерыДоговоровФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерыДоговоровФинансовыхИнструментов</name>
  <enumValues>
    <name>КредитИлиЗайм</name>
  </enumValues>
  <enumValues>
    <name>Депозит</name>
  </enumValues>
  <enumValues>
    <name>ЗаймВыданный</name>
  </enumValues>
  <enumValues>
    <name>Лизинг</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ХарактерыДоговоровФинансовыхИнструментов/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов") Тогда
		ДанныеВыбора.Добавить(Перечисления.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм);
		ДанныеВыбора.Добавить(Перечисления.ХарактерыДоговоровФинансовыхИнструментов.Депозит);
		ДанныеВыбора.Добавить(Перечисления.ХарактерыДоговоровФинансовыхИнструментов.ЗаймВыданный);
	КонецЕсли;
	
	//++ НЕ УТ
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЛизинг") Тогда
		ДанныеВыбора.Добавить(Перечисления.ХарактерыДоговоровФинансовыхИнструментов.Лизинг);
	КонецЕсли;
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти
